# Pandası import etmə

In [1]:
# !pip install pandas #colabda pandas yukludur
import pandas as pd

# Series yaratmaq

In [2]:
my_data = ['Babek', 'Gunel', 'Mehi', 'Dilara']
my_data

['Babek', 'Gunel', 'Mehi', 'Dilara']

In [3]:
pd.Series(my_data)

0     Babek
1     Gunel
2      Mehi
3    Dilara
dtype: object

In [4]:
my_data = [1923, 1776, 1876]
my_idx = ['Turkiye', 'USA', 'Canada']

In [5]:
my_data

[1923, 1776, 1876]

In [6]:
my_idx

['Turkiye', 'USA', 'Canada']

In [7]:
pd.Series(my_data, my_idx)

Turkiye    1923
USA        1776
Canada     1876
dtype: int64

In [8]:
pd.Series(data= my_data, index=my_idx)

Turkiye    1923
USA        1776
Canada     1876
dtype: int64

In [9]:
my_dict = {
    'Babek': 21,
    'Gunel': 22,
    'Mehi': 28
}

In [10]:
my_dict

{'Babek': 21, 'Gunel': 22, 'Mehi': 28}

In [11]:
pd.Series(my_dict)

Babek    21
Gunel    22
Mehi     28
dtype: int64

In [12]:
pd.Series(data = my_dict, name='muhtesem_uclu')

Babek    21
Gunel    22
Mehi     28
Name: muhtesem_uclu, dtype: int64

In [13]:
pd.Series({'Mehi': 28, 'Babek': 21, 'Gunel':22}, name= 'muht_uclu')

Mehi     28
Babek    21
Gunel    22
Name: muht_uclu, dtype: int64

In [14]:
my_city = ['Istanbul', 'Izmir', 'Ankara', 'Bursa']
my_number = [15.4, 4.3, 5.6, 3]

In [15]:
my_number

[15.4, 4.3, 5.6, 3]

In [16]:
pd.Series(my_number, my_city)

Istanbul    15.4
Izmir        4.3
Ankara       5.6
Bursa        3.0
dtype: float64

In [17]:
pd.Series(data= my_number, index=my_city,name='cities')

Istanbul    15.4
Izmir        4.3
Ankara       5.6
Bursa        3.0
Name: cities, dtype: float64

In [18]:
pd.Series(data= ['Istanbul','Ankara','Bursa'])

0    Istanbul
1      Ankara
2       Bursa
dtype: object

In [19]:
pd.Series(data= ['Istanbul','Ankara','Bursa'],index=[15.4 ,5.6, 3])

15.4    Istanbul
5.6       Ankara
3.0        Bursa
dtype: object

In [20]:
my_dictionary = {
    'Istanbul': 15.4,
    'Izmir': 4.3,
    'Ankara': 5.6,
    'Bursa': 3
}

In [21]:
pd.Series(my_dictionary)

Istanbul    15.4
Izmir        4.3
Ankara       5.6
Bursa        3.0
dtype: float64

In [22]:
pd.Series(data= my_dictionary, name= 'city_num')

Istanbul    15.4
Izmir        4.3
Ankara       5.6
Bursa        3.0
Name: city_num, dtype: float64

In [23]:
pd.Series({'Istanbul': 15,
           'Izmir': 4,
           'Ankara': 5,
           'Bursa': 3},name= 'numbers')

Istanbul    15
Izmir        4
Ankara       5
Bursa        3
Name: numbers, dtype: int64

In [24]:
q1 ={'Japan': 200, 'Turkey': 150, 'China' :500, 'India': 300}
q1

{'Japan': 200, 'Turkey': 150, 'China': 500, 'India': 300}

In [25]:
q2 ={'Japan': 230, 'Turkey': 180, 'China' :490, 'India': 295}
q2

{'Japan': 230, 'Turkey': 180, 'China': 490, 'India': 295}

In [26]:
sales_q1 = pd.Series(q1)
sales_q1

Japan     200
Turkey    150
China     500
India     300
dtype: int64

In [27]:
sales_q2 = pd.Series(q2)
sales_q2

Japan     230
Turkey    180
China     490
India     295
dtype: int64

In [28]:
sales_total = sales_q1 + sales_q2
sales_total

Japan     430
Turkey    330
China     990
India     595
dtype: int64

In [29]:
sales_total.index

Index(['Japan', 'Turkey', 'China', 'India'], dtype='object')

In [30]:
sales_total.keys()

Index(['Japan', 'Turkey', 'China', 'India'], dtype='object')

In [31]:
sales_total.values

array([430, 330, 990, 595])

In [32]:
sales_total * 2

Japan      860
Turkey     660
China     1980
India     1190
dtype: int64

In [33]:
sales_total / 10

Japan     43.0
Turkey    33.0
China     99.0
India     59.5
dtype: float64

In [34]:
sales_q2 - sales_q1

Japan     30
Turkey    30
China    -10
India     -5
dtype: int64

In [41]:
q1 = {'Japan': 30, 'India': 40, 'Turkey':50,'China': 90}
q1

{'Japan': 30, 'India': 40, 'Turkey': 50, 'China': 90}

In [46]:
q2 = {'Brazil': 10, 'India': 35, 'Turkey':55,'China': 95}
q2

{'Brazil': 10, 'India': 35, 'Turkey': 55, 'China': 95}

In [47]:
sales_q1 = pd.Series(q1)
sales_q1

Japan     30
India     40
Turkey    50
China     90
dtype: int64

In [48]:
sales_q2 = pd.Series(q2)
sales_q2

Brazil    10
India     35
Turkey    55
China     95
dtype: int64

In [49]:
sales_total = sales_q1 + sales_q2
sales_total

Brazil      NaN
China     185.0
India      75.0
Japan       NaN
Turkey    105.0
dtype: float64

In [51]:
sales_q1.add(sales_q2, fill_value= 0)

Brazil     10.0
China     185.0
India      75.0
Japan      30.0
Turkey    105.0
dtype: float64

In [53]:
sales_q1

Japan     30
India     40
Turkey    50
China     90
dtype: int64

In [54]:
sales_q1.dtype

dtype('int64')

In [55]:
lg_2020 ={'fenerbahce': 82, 'Galatasaray': 84, 'Besiktas': 84, 'Trabzonspor': 71}
lg_2020

{'fenerbahce': 82, 'Galatasaray': 84, 'Besiktas': 84, 'Trabzonspor': 71}

In [58]:
league_2020 = pd.Series(lg_2020, name = 'League2020')
league_2020

fenerbahce     82
Galatasaray    84
Besiktas       84
Trabzonspor    71
Name: League2020, dtype: int64

In [59]:
lg_2021 ={'fenerbahce': 73, 'Galatasaray': 68, 'Besiktas': 59, 'Trabzonspor': 81}
lg_2021

{'fenerbahce': 73, 'Galatasaray': 68, 'Besiktas': 59, 'Trabzonspor': 81}

In [63]:
league_2021 = pd.Series(lg_2021, name='league2021')
league_2021

fenerbahce     73
Galatasaray    68
Besiktas       59
Trabzonspor    81
Name: league2021, dtype: int64

In [62]:
lg_2022 ={'fenerbahce': 51, 'Galatasaray': 60, 'Besiktas': 48, 'Trabzonspor': 41}
lg_2022

{'fenerbahce': 51, 'Galatasaray': 60, 'Besiktas': 48, 'Trabzonspor': 41}

In [64]:
league_2022 = pd.Series(lg_2022, name='league2022')
league_2022

fenerbahce     51
Galatasaray    60
Besiktas       48
Trabzonspor    41
Name: league2022, dtype: int64

In [66]:
league_total = league_2020 + league_2021 + league_2022
league_total

fenerbahce     206
Galatasaray    212
Besiktas       191
Trabzonspor    193
dtype: int64

In [69]:
l2020 = pd.Series(data= [82, 84, 84, 71])
l2020

0    82
1    84
2    84
3    71
dtype: int64

In [70]:
l2020 = pd.Series(data= [82, 84, 84, 71], index=['Fenerbahce','besiktas','trabzonspor','galatasaray'])
l2020

Fenerbahce     82
besiktas       84
trabzonspor    84
galatasaray    71
dtype: int64

In [71]:
l2020 = pd.Series(data= {'Fenerbahce': 83, 'Besiktas': 70, 'Trabzonspor': 50, 'Galatasaray': 75})
l2020

Fenerbahce     83
Besiktas       70
Trabzonspor    50
Galatasaray    75
dtype: int64

In [ ]:
#Done